"use strict"

let summa = 0;
let answers = [
    "a",
    "a",
    "a",
];

if (confirm("Привет, выбери три критерия для сайта, что расчитать его цену.")){
answers[0] = prompt("Тип сайта? Варианты: а) Сайт-визитка (+5000 руб) б) Корпоративный (+10000 руб) в) Интернет-магазин (+20000 руб)", "а");
answers[1] = prompt("Дизайн сайта? Варианты: а) Шаблонный (+5000 руб) б) Эксклюзивный (+10000 руб) в) Легендарный (+20000 руб)", "а");
answers[2] = prompt("Адаптация сайта? Варианты: а) Для компьютеров (+5000 руб) б) Для смартфонов (+5000 руб) в) Для компьютеров и смартфонов (+10000 руб)", "в");

//console.log(answers[0], answers[1], answers[2]);

if (answers[0] === "а") {
    summa += 5000;
}
else if (answers[0] === "б") {
    summa += 10000;
}
else {
    summa += 20000;
}

if (answers[1] === "а") {
    summa += 5000;
}
else if (answers[1] === "б") {
    summa += 10000;
}
else {
    summa += 20000;
}

if (answers[2] === "а" || answers[2] === "б") {
    summa += 5000;
}
else {
    summa += 10000;
}

//console.log(summa);
alert(`Итоговая сумма: ${summa} руб`);
}
